<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ServicesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {



        $services = [
            [
                'service_name' => 'مهندس مدني',
                'service_desc' => 'مهندس مدني متخصص في تصميم وتنفيذ المشاريع الهندسية المدنية، مثل الجسور والطرق والمباني. يقوم بدراسة المشروعات وتحليل الأمور الهندسية والبيئية لضمان البنية التحتية ذات الجودة.'
            ],
            [
                'service_name' => 'مهندس كهرباء',
                'service_desc' => 'متخصص في التخطيط وتصميم وصيانة الأنظمة الكهربائية. يعمل على توفير الطاقة الكهربائية بشكل فعال وآمن، سواء في المنشآت الصناعية أو المباني السكنية.'
            ],
            ['service_name' => 'مهندس برمجيات', 'service_desc' => 'مطور برمجيات محترف يقوم بتصميم وبرمجة التطبيقات والبرامج الحاسوبية. يتخذ من مهاراته البرمجية لضمان تلبية احتياجات العملاء وتطوير حلول برمجية فعّالة.'],
            ['service_name' => 'فني صيانة', 'service_desc' => 'متخصص في صيانة وإصلاح معدات وأنظمة مختلفة، سواء كانت آليات صناعية أو أجهزة إلكترونية. يعتمد على مهاراته الفنية لضمان أداء مستدام للمعدات.'],
            ['service_name' => 'محاسب', 'service_desc' => 'خبير في مجال المحاسبة يدير السجلات المالية ويحلل البيانات المالية للمساعدة في اتخاذ القرارات المالية الصائبة. يلتزم بمعايير المحاسبة لضمان دقة التقارير المالية.'],
            ['service_name' => 'عامل', 'service_desc' => 'يشمل مجموعة واسعة من المهن والخدمات.'],
            ['service_name' => 'مصور', 'service_desc' => 'فنان تصوير يسجل اللحظات المميزة بفنه ومهارته في التصوير الفوتوغرافي. يمكن أن يكون تخصصه في مجالات مثل التصوير الفوتوغرافي الفني أو تصوير الفعاليات والأحداث.'],
            ['service_name' => 'مزارع', 'service_desc' => 'شخص متخصص في زراعة الأراضي وتربية المحاصيل أو رعاية الحيوانات.'],
            ['service_name' => 'مهندس زراعي', 'service_desc' => 'مهندس متخصص في تطوير وتحسين الأنظمة الزراعية واستخدام التكنولوجيا في تحسين الإنتاج الزراعي.'],
            ['service_name' => 'فني زراعي', 'service_desc' => 'متخصص في تقديم الدعم الفني للأنشطة الزراعية، مثل صيانة الأدوات والمعدات الزراعية.'],
            ['service_name' => 'مصمم جرافيك', 'service_desc' => 'فنان مبدع يقوم بتصميم الرسومات والصور بطريقة إبداعية للاستخدام في وسائل التواصل المرئي والدعاية والإعلان.'],
            ['service_name' => 'محاسب تجاري', 'service_desc' => 'محاسب متخصص في مجال الأعمال التجارية، يدير ويحلل السجلات المالية للشركات ويقدم استشارات مالية لتحسين الأداء التجاري.'],
            ['service_name' => 'مسؤول تسويق', 'service_desc' => 'متخصص في تطوير وتنفيذ استراتيجيات التسويق لزيادة رؤية المنتج أو الخدمة في السوق. يستخدم وسائل التسويق التقليدية والرقمية لتحقيق الأهداف المحددة.'],
            ['service_name' => 'عامل بناء', 'service_desc' => 'يشارك في أعمال البناء والتشييد، بما في ذلك الأعمال الخرسانية والهيكلية للمباني.'],
            ['service_name' => 'مهندس معماري', 'service_desc' => 'مهندس متخصص في تصميم المباني والهياكل بطريقة تجمع بين الجمال والوظائف الهندسية.'],
            ['service_name' => 'فني تشييد', 'service_desc' => 'متخصص في تنفيذ الأعمال الإنشائية والتشييدية وتنفيذ التصاميم الهندسية.'],
            ['service_name' => 'موظف استقبال', 'service_desc' => 'يدير استقبال الزوار والعملاء في المؤسسات ويدير مكتب الاستقبال بكفاءة.'],
            ['service_name' => 'نادل', 'service_desc' => 'يقدم خدمة تقديم الطعام والمشروبات في المطاعم والمقاهي، ويضمن تجربة إيجابية للزبائن.'],
            ['service_name' => 'سائق سياحي', 'service_desc' => 'سائق محترف مختص في نقل الزوار والسياح بشكل آمن ومريح في الوجهات السياحية.'],
            ['service_name' => 'مرشد سياحي', 'service_desc' => 'يوفر معلومات ثقافية وتاريخية للزوار في الوجهات السياحية، ويسهم في توجيههم وتوفير تجربة سياحية مميزة.'],
            ['service_name' => 'سائق شاحنة', 'service_desc' => 'سائق محترف متخصص في قيادة الشاحنات لنقل البضائع بين المواقع بشكل فعّال وآمن.'],
            ['service_name' => 'منسق لوجستي', 'service_desc' => 'يدير وينظم عمليات اللوجستيات وسلسلة التوريد لضمان تدفق سلس للمواد والسلع.'],
            ['service_name' => 'مدير مستودع', 'service_desc' => 'يدير العمليات في المستودع، بما في ذلك تخزين وتوزيع المواد بشكل فعّال.'],
            ['service_name' => 'فني إصلاح مركبات', 'service_desc' => 'متخصص في إصلاح وصيانة المركبات، بما في ذلك السيارات والدراجات النارية.'],
            ['service_name' => 'حرفي', 'service_desc' => 'شخص يمتلك مهارات حرفية في مجال معين مثل النجارة أو الخياطة أو صناعة المجوهرات.'],
            ['service_name' => 'صانع مجوهرات', 'service_desc' => 'فنان يختص في تصميم وصناعة المجوهرات بأشكالها وأحجامها المختلفة.'],
            ['service_name' => 'نجار', 'service_desc' => 'حرفي يعمل في تشكيل وتصنيع الأثاث والهياكل الخشبية.'],
            ['service_name' => 'خياط', 'service_desc' => 'فنان يتخذ من الخياطة مهنة، سواء في تصميم وخياطة الملابس أو الأقمشة الفنية.'],
            ['service_name' => 'مطور برمجيات', 'service_desc' => 'محترف في تطوير البرمجيات يقوم بإنشاء وصيانة التطبيقات والأنظمة البرمجية.'],
            ['service_name' => 'محلل بيانات', 'service_desc' => 'متخصص في تحليل البيانات واستخراج الأفكار والتوجيهات لدعم عمليات اتخاذ القرار في المؤسسات.'],
            ['service_name' => 'مهندس اتصالات', 'service_desc' => 'متخصص في تصميم وصيانة الأنظمة والشبكات الاتصالات لضمان تدفق فعال للمعلومات.'],
        ];




        DB::table('services')->insert($services);
    }
}
